export interface CityCoord {
  name: string;
  lat: number;
  lng: number;
}

export interface ProvinceCoord {
  name: string;
  lat: number;
  lng: number;
  cities: CityCoord[];
}

export const CHINA_PROVINCES: ProvinceCoord[] = [
  {
    "name": "北京市",
    "lat": 39.9042,
    "lng": 116.4074,
    "cities": [
      {
        "name": "东城区",
        "lat": 39.9284,
        "lng": 116.4163
      },
      {
        "name": "西城区",
        "lat": 39.9126,
        "lng": 116.3658
      },
      {
        "name": "朝阳区",
        "lat": 39.9214,
        "lng": 116.4431
      },
      {
        "name": "丰台区",
        "lat": 39.8585,
        "lng": 116.2867
      },
      {
        "name": "石景山区",
        "lat": 39.9063,
        "lng": 116.223
      },
      {
        "name": "海淀区",
        "lat": 39.9599,
        "lng": 116.2977
      },
      {
        "name": "门头沟区",
        "lat": 39.9408,
        "lng": 116.1017
      },
      {
        "name": "房山区",
        "lat": 39.7489,
        "lng": 116.1434
      },
      {
        "name": "通州区",
        "lat": 39.9164,
        "lng": 116.7292
      },
      {
        "name": "顺义区",
        "lat": 40.1499,
        "lng": 116.6615
      },
      {
        "name": "昌平区",
        "lat": 40.221,
        "lng": 116.231
      },
      {
        "name": "大兴区",
        "lat": 39.7269,
        "lng": 116.3415
      },
      {
        "name": "怀柔区",
        "lat": 40.317,
        "lng": 116.632
      },
      {
        "name": "平谷区",
        "lat": 40.1408,
        "lng": 117.1216
      },
      {
        "name": "密云区",
        "lat": 40.3771,
        "lng": 116.8434
      },
      {
        "name": "延庆区",
        "lat": 40.457,
        "lng": 115.9746
      }
    ]
  },
  {
    "name": "天津市",
    "lat": 39.0853,
    "lng": 117.2015,
    "cities": [
      {
        "name": "和平区",
        "lat": 39.1169,
        "lng": 117.2147
      },
      {
        "name": "河东区",
        "lat": 39.1283,
        "lng": 117.2516
      },
      {
        "name": "河西区",
        "lat": 39.1097,
        "lng": 117.2234
      },
      {
        "name": "南开区",
        "lat": 39.1386,
        "lng": 117.1506
      },
      {
        "name": "河北区",
        "lat": 39.148,
        "lng": 117.1969
      },
      {
        "name": "红桥区",
        "lat": 39.1673,
        "lng": 117.1516
      },
      {
        "name": "东丽区",
        "lat": 39.0868,
        "lng": 117.3136
      },
      {
        "name": "西青区",
        "lat": 39.1418,
        "lng": 117.009
      },
      {
        "name": "津南区",
        "lat": 38.937,
        "lng": 117.3567
      },
      {
        "name": "北辰区",
        "lat": 39.2246,
        "lng": 117.1356
      },
      {
        "name": "武清区",
        "lat": 39.3841,
        "lng": 117.0446
      },
      {
        "name": "宝坻区",
        "lat": 39.7171,
        "lng": 117.3097
      },
      {
        "name": "滨海新区",
        "lat": 39.0178,
        "lng": 117.6964
      },
      {
        "name": "宁河区",
        "lat": 39.3297,
        "lng": 117.8267
      },
      {
        "name": "静海区",
        "lat": 38.9478,
        "lng": 116.9755
      },
      {
        "name": "蓟州区",
        "lat": 40.0465,
        "lng": 117.4084
      }
    ]
  },
  {
    "name": "河北省",
    "lat": 38.0377,
    "lng": 114.5304,
    "cities": [
      {
        "name": "石家庄市",
        "lat": 38.042,
        "lng": 114.515
      },
      {
        "name": "唐山市",
        "lat": 39.6307,
        "lng": 118.1801
      },
      {
        "name": "秦皇岛市",
        "lat": 39.8882,
        "lng": 119.5202
      },
      {
        "name": "邯郸市",
        "lat": 36.6258,
        "lng": 114.5392
      },
      {
        "name": "邢台市",
        "lat": 37.0602,
        "lng": 114.4974
      },
      {
        "name": "保定市",
        "lat": 38.8745,
        "lng": 115.4645
      },
      {
        "name": "张家口市",
        "lat": 40.7689,
        "lng": 114.8859
      },
      {
        "name": "承德市",
        "lat": 40.9529,
        "lng": 117.9627
      },
      {
        "name": "沧州市",
        "lat": 38.3047,
        "lng": 116.8387
      },
      {
        "name": "廊坊市",
        "lat": 39.5383,
        "lng": 116.6835
      },
      {
        "name": "衡水市",
        "lat": 37.7394,
        "lng": 115.669
      }
    ]
  },
  {
    "name": "山西省",
    "lat": 37.8139,
    "lng": 112.5788,
    "cities": [
      {
        "name": "太原市",
        "lat": 37.8705,
        "lng": 112.5497
      },
      {
        "name": "大同市",
        "lat": 40.0971,
        "lng": 113.3667
      },
      {
        "name": "阳泉市",
        "lat": 37.8571,
        "lng": 113.5804
      },
      {
        "name": "长治市",
        "lat": 36.1951,
        "lng": 113.1174
      },
      {
        "name": "晋城市",
        "lat": 35.4913,
        "lng": 112.852
      },
      {
        "name": "朔州市",
        "lat": 39.3317,
        "lng": 112.4329
      },
      {
        "name": "晋中市",
        "lat": 37.688,
        "lng": 112.7526
      },
      {
        "name": "运城市",
        "lat": 35.0267,
        "lng": 111.0071
      },
      {
        "name": "忻州市",
        "lat": 38.416,
        "lng": 112.7341
      },
      {
        "name": "临汾市",
        "lat": 36.0886,
        "lng": 111.5193
      },
      {
        "name": "吕梁市",
        "lat": 37.519,
        "lng": 111.1445
      }
    ]
  },
  {
    "name": "内蒙古自治区",
    "lat": 40.8182,
    "lng": 111.7652,
    "cities": [
      {
        "name": "呼和浩特市",
        "lat": 40.8421,
        "lng": 111.7488
      },
      {
        "name": "包头市",
        "lat": 40.6213,
        "lng": 109.9531
      },
      {
        "name": "乌海市",
        "lat": 39.655,
        "lng": 106.7942
      },
      {
        "name": "赤峰市",
        "lat": 42.2569,
        "lng": 118.8876
      },
      {
        "name": "通辽市",
        "lat": 43.6536,
        "lng": 122.2433
      },
      {
        "name": "鄂尔多斯市",
        "lat": 39.6087,
        "lng": 109.7825
      },
      {
        "name": "呼伦贝尔市",
        "lat": 49.1665,
        "lng": 119.7785
      },
      {
        "name": "巴彦淖尔市",
        "lat": 40.743,
        "lng": 107.3878
      },
      {
        "name": "乌兰察布市",
        "lat": 40.9945,
        "lng": 113.1322
      },
      {
        "name": "兴安盟",
        "lat": 46.0824,
        "lng": 122.0378
      },
      {
        "name": "锡林郭勒盟",
        "lat": 43.9332,
        "lng": 116.0474
      },
      {
        "name": "阿拉善盟",
        "lat": 38.8516,
        "lng": 105.7291
      }
    ]
  },
  {
    "name": "辽宁省",
    "lat": 41.8367,
    "lng": 123.4351,
    "cities": [
      {
        "name": "沈阳市",
        "lat": 41.6776,
        "lng": 123.4647
      },
      {
        "name": "大连市",
        "lat": 38.914,
        "lng": 121.6148
      },
      {
        "name": "鞍山市",
        "lat": 41.1082,
        "lng": 122.9942
      },
      {
        "name": "抚顺市",
        "lat": 41.8813,
        "lng": 123.9571
      },
      {
        "name": "本溪市",
        "lat": 41.2941,
        "lng": 123.7667
      },
      {
        "name": "丹东市",
        "lat": 40.0006,
        "lng": 124.3544
      },
      {
        "name": "锦州市",
        "lat": 41.0961,
        "lng": 121.1269
      },
      {
        "name": "营口市",
        "lat": 40.625,
        "lng": 122.2191
      },
      {
        "name": "阜新市",
        "lat": 42.022,
        "lng": 121.6701
      },
      {
        "name": "辽阳市",
        "lat": 41.2674,
        "lng": 123.2397
      },
      {
        "name": "盘锦市",
        "lat": 40.7196,
        "lng": 122.1707
      },
      {
        "name": "铁岭市",
        "lat": 42.2237,
        "lng": 123.726
      },
      {
        "name": "朝阳市",
        "lat": 41.6019,
        "lng": 120.4888
      },
      {
        "name": "葫芦岛市",
        "lat": 40.711,
        "lng": 120.8368
      }
    ]
  },
  {
    "name": "吉林省",
    "lat": 43.8969,
    "lng": 125.3258,
    "cities": [
      {
        "name": "长春市",
        "lat": 43.817,
        "lng": 125.3236
      },
      {
        "name": "吉林市",
        "lat": 43.8381,
        "lng": 126.5497
      },
      {
        "name": "四平市",
        "lat": 43.1668,
        "lng": 124.3506
      },
      {
        "name": "辽源市",
        "lat": 42.888,
        "lng": 125.1447
      },
      {
        "name": "通化市",
        "lat": 41.7283,
        "lng": 125.9397
      },
      {
        "name": "白山市",
        "lat": 41.9441,
        "lng": 126.4143
      },
      {
        "name": "松原市",
        "lat": 45.1419,
        "lng": 124.8253
      },
      {
        "name": "白城市",
        "lat": 45.6201,
        "lng": 122.8381
      },
      {
        "name": "延边朝鲜族自治州",
        "lat": 42.9094,
        "lng": 129.4706
      }
    ]
  },
  {
    "name": "黑龙江省",
    "lat": 45.7423,
    "lng": 126.662,
    "cities": [
      {
        "name": "哈尔滨市",
        "lat": 45.803,
        "lng": 126.535
      },
      {
        "name": "齐齐哈尔市",
        "lat": 47.3549,
        "lng": 123.9182
      },
      {
        "name": "鸡西市",
        "lat": 45.2951,
        "lng": 130.9694
      },
      {
        "name": "鹤岗市",
        "lat": 47.3507,
        "lng": 130.2977
      },
      {
        "name": "双鸭山市",
        "lat": 46.6762,
        "lng": 131.1416
      },
      {
        "name": "大庆市",
        "lat": 46.5895,
        "lng": 125.1041
      },
      {
        "name": "伊春市",
        "lat": 47.7283,
        "lng": 128.8409
      },
      {
        "name": "佳木斯市",
        "lat": 46.8,
        "lng": 130.3189
      },
      {
        "name": "七台河市",
        "lat": 45.7712,
        "lng": 131.003
      },
      {
        "name": "牡丹江市",
        "lat": 44.5515,
        "lng": 129.6329
      },
      {
        "name": "黑河市",
        "lat": 50.2449,
        "lng": 127.5282
      },
      {
        "name": "绥化市",
        "lat": 46.6541,
        "lng": 126.9687
      },
      {
        "name": "大兴安岭地区",
        "lat": 50.4113,
        "lng": 124.1179
      }
    ]
  },
  {
    "name": "上海市",
    "lat": 31.2305,
    "lng": 121.4737,
    "cities": [
      {
        "name": "黄浦区",
        "lat": 31.2317,
        "lng": 121.4844
      },
      {
        "name": "徐汇区",
        "lat": 31.1883,
        "lng": 121.4363
      },
      {
        "name": "长宁区",
        "lat": 31.2205,
        "lng": 121.4248
      },
      {
        "name": "静安区",
        "lat": 31.2277,
        "lng": 121.4473
      },
      {
        "name": "普陀区",
        "lat": 31.2496,
        "lng": 121.3955
      },
      {
        "name": "虹口区",
        "lat": 31.2649,
        "lng": 121.505
      },
      {
        "name": "杨浦区",
        "lat": 31.2596,
        "lng": 121.5254
      },
      {
        "name": "闵行区",
        "lat": 31.1128,
        "lng": 121.3809
      },
      {
        "name": "宝山区",
        "lat": 31.4052,
        "lng": 121.4894
      },
      {
        "name": "嘉定区",
        "lat": 31.3756,
        "lng": 121.2653
      },
      {
        "name": "浦东新区",
        "lat": 31.2215,
        "lng": 121.5443
      },
      {
        "name": "金山区",
        "lat": 30.7428,
        "lng": 121.3418
      },
      {
        "name": "松江区",
        "lat": 31.0326,
        "lng": 121.2277
      },
      {
        "name": "青浦区",
        "lat": 31.151,
        "lng": 121.1242
      },
      {
        "name": "奉贤区",
        "lat": 30.9184,
        "lng": 121.4739
      },
      {
        "name": "崇明区",
        "lat": 31.6239,
        "lng": 121.3977
      }
    ]
  },
  {
    "name": "江苏省",
    "lat": 32.0614,
    "lng": 118.7636,
    "cities": [
      {
        "name": "南京市",
        "lat": 32.0593,
        "lng": 118.7966
      },
      {
        "name": "无锡市",
        "lat": 31.4911,
        "lng": 120.3119
      },
      {
        "name": "徐州市",
        "lat": 34.2042,
        "lng": 117.2838
      },
      {
        "name": "常州市",
        "lat": 31.8113,
        "lng": 119.9741
      },
      {
        "name": "苏州市",
        "lat": 31.2998,
        "lng": 120.5853
      },
      {
        "name": "南通市",
        "lat": 31.9813,
        "lng": 120.8945
      },
      {
        "name": "连云港市",
        "lat": 34.5966,
        "lng": 119.2215
      },
      {
        "name": "淮安市",
        "lat": 33.5515,
        "lng": 119.1132
      },
      {
        "name": "盐城市",
        "lat": 33.3482,
        "lng": 120.1626
      },
      {
        "name": "扬州市",
        "lat": 32.3944,
        "lng": 119.4128
      },
      {
        "name": "镇江市",
        "lat": 32.1881,
        "lng": 119.4244
      },
      {
        "name": "泰州市",
        "lat": 32.4567,
        "lng": 119.9229
      },
      {
        "name": "宿迁市",
        "lat": 33.9632,
        "lng": 118.2752
      }
    ]
  },
  {
    "name": "浙江省",
    "lat": 30.2666,
    "lng": 120.1526,
    "cities": [
      {
        "name": "杭州市",
        "lat": 30.2466,
        "lng": 120.2099
      },
      {
        "name": "宁波市",
        "lat": 29.8603,
        "lng": 121.6245
      },
      {
        "name": "温州市",
        "lat": 27.9938,
        "lng": 120.6993
      },
      {
        "name": "嘉兴市",
        "lat": 30.7468,
        "lng": 120.7556
      },
      {
        "name": "湖州市",
        "lat": 30.8942,
        "lng": 120.0869
      },
      {
        "name": "绍兴市",
        "lat": 30.0515,
        "lng": 120.5829
      },
      {
        "name": "金华市",
        "lat": 29.0792,
        "lng": 119.6473
      },
      {
        "name": "衢州市",
        "lat": 28.9702,
        "lng": 118.8593
      },
      {
        "name": "舟山市",
        "lat": 29.9856,
        "lng": 122.2074
      },
      {
        "name": "台州市",
        "lat": 28.6557,
        "lng": 121.4208
      },
      {
        "name": "丽水市",
        "lat": 28.4677,
        "lng": 119.9232
      }
    ]
  },
  {
    "name": "安徽省",
    "lat": 31.7346,
    "lng": 117.3301,
    "cities": [
      {
        "name": "合肥市",
        "lat": 31.8206,
        "lng": 117.2273
      },
      {
        "name": "芜湖市",
        "lat": 31.3526,
        "lng": 118.4331
      },
      {
        "name": "蚌埠市",
        "lat": 32.9168,
        "lng": 117.3886
      },
      {
        "name": "淮南市",
        "lat": 32.5854,
        "lng": 117.0186
      },
      {
        "name": "马鞍山市",
        "lat": 31.6688,
        "lng": 118.5069
      },
      {
        "name": "淮北市",
        "lat": 33.9563,
        "lng": 116.7984
      },
      {
        "name": "铜陵市",
        "lat": 30.9452,
        "lng": 117.8113
      },
      {
        "name": "安庆市",
        "lat": 30.5318,
        "lng": 117.1153
      },
      {
        "name": "黄山市",
        "lat": 29.7149,
        "lng": 118.3376
      },
      {
        "name": "滁州市",
        "lat": 32.2559,
        "lng": 118.3334
      },
      {
        "name": "阜阳市",
        "lat": 32.891,
        "lng": 115.8143
      },
      {
        "name": "宿州市",
        "lat": 33.6477,
        "lng": 116.9642
      },
      {
        "name": "六安市",
        "lat": 31.7359,
        "lng": 116.5197
      },
      {
        "name": "亳州市",
        "lat": 33.8463,
        "lng": 115.7786
      },
      {
        "name": "池州市",
        "lat": 30.6743,
        "lng": 117.4957
      },
      {
        "name": "宣城市",
        "lat": 30.9393,
        "lng": 118.7591
      }
    ]
  },
  {
    "name": "福建省",
    "lat": 26.1011,
    "lng": 119.2962,
    "cities": [
      {
        "name": "福州市",
        "lat": 26.0743,
        "lng": 119.2964
      },
      {
        "name": "厦门市",
        "lat": 24.4796,
        "lng": 118.0889
      },
      {
        "name": "莆田市",
        "lat": 25.4542,
        "lng": 119.0077
      },
      {
        "name": "三明市",
        "lat": 26.2635,
        "lng": 117.6389
      },
      {
        "name": "泉州市",
        "lat": 24.8745,
        "lng": 118.6757
      },
      {
        "name": "漳州市",
        "lat": 24.5153,
        "lng": 117.6473
      },
      {
        "name": "南平市",
        "lat": 27.3828,
        "lng": 118.0813
      },
      {
        "name": "龙岩市",
        "lat": 25.0759,
        "lng": 117.0174
      },
      {
        "name": "宁德市",
        "lat": 26.6662,
        "lng": 119.5477
      }
    ]
  },
  {
    "name": "江西省",
    "lat": 28.6372,
    "lng": 115.8166,
    "cities": [
      {
        "name": "南昌市",
        "lat": 28.683,
        "lng": 115.858
      },
      {
        "name": "景德镇市",
        "lat": 29.2744,
        "lng": 117.1849
      },
      {
        "name": "萍乡市",
        "lat": 27.6587,
        "lng": 113.8871
      },
      {
        "name": "九江市",
        "lat": 29.6612,
        "lng": 115.9536
      },
      {
        "name": "新余市",
        "lat": 27.8186,
        "lng": 114.9167
      },
      {
        "name": "鹰潭市",
        "lat": 28.2721,
        "lng": 117.0395
      },
      {
        "name": "赣州市",
        "lat": 25.8311,
        "lng": 114.9335
      },
      {
        "name": "吉安市",
        "lat": 27.0912,
        "lng": 114.9668
      },
      {
        "name": "宜春市",
        "lat": 27.8162,
        "lng": 114.4168
      },
      {
        "name": "抚州市",
        "lat": 27.949,
        "lng": 116.3581
      },
      {
        "name": "上饶市",
        "lat": 28.4551,
        "lng": 117.9431
      }
    ]
  },
  {
    "name": "山东省",
    "lat": 36.6702,
    "lng": 117.0207,
    "cities": [
      {
        "name": "济南市",
        "lat": 36.6521,
        "lng": 117.1201
      },
      {
        "name": "青岛市",
        "lat": 36.0669,
        "lng": 120.3827
      },
      {
        "name": "淄博市",
        "lat": 36.8138,
        "lng": 118.055
      },
      {
        "name": "枣庄市",
        "lat": 34.8109,
        "lng": 117.3238
      },
      {
        "name": "东营市",
        "lat": 37.434,
        "lng": 118.6746
      },
      {
        "name": "烟台市",
        "lat": 37.4646,
        "lng": 121.4478
      },
      {
        "name": "潍坊市",
        "lat": 36.7077,
        "lng": 119.1617
      },
      {
        "name": "济宁市",
        "lat": 35.4151,
        "lng": 116.5871
      },
      {
        "name": "泰安市",
        "lat": 36.2018,
        "lng": 117.087
      },
      {
        "name": "威海市",
        "lat": 37.5133,
        "lng": 122.1205
      },
      {
        "name": "日照市",
        "lat": 35.4169,
        "lng": 119.5268
      },
      {
        "name": "临沂市",
        "lat": 35.1038,
        "lng": 118.3565
      },
      {
        "name": "德州市",
        "lat": 37.4365,
        "lng": 116.3592
      },
      {
        "name": "聊城市",
        "lat": 36.4559,
        "lng": 115.9852
      },
      {
        "name": "滨州市",
        "lat": 37.3827,
        "lng": 117.9707
      },
      {
        "name": "菏泽市",
        "lat": 35.2343,
        "lng": 115.4796
      }
    ]
  },
  {
    "name": "河南省",
    "lat": 34.7671,
    "lng": 113.7531,
    "cities": [
      {
        "name": "郑州市",
        "lat": 34.7463,
        "lng": 113.6254
      },
      {
        "name": "开封市",
        "lat": 34.7981,
        "lng": 114.3143
      },
      {
        "name": "洛阳市",
        "lat": 34.6197,
        "lng": 112.4539
      },
      {
        "name": "平顶山市",
        "lat": 33.7666,
        "lng": 113.1926
      },
      {
        "name": "安阳市",
        "lat": 36.0988,
        "lng": 114.3925
      },
      {
        "name": "鹤壁市",
        "lat": 35.7483,
        "lng": 114.2973
      },
      {
        "name": "新乡市",
        "lat": 35.3036,
        "lng": 113.9268
      },
      {
        "name": "焦作市",
        "lat": 35.2157,
        "lng": 113.2419
      },
      {
        "name": "濮阳市",
        "lat": 35.7627,
        "lng": 115.0292
      },
      {
        "name": "许昌市",
        "lat": 34.0373,
        "lng": 113.852
      },
      {
        "name": "漯河市",
        "lat": 33.5804,
        "lng": 114.0166
      },
      {
        "name": "三门峡市",
        "lat": 34.7732,
        "lng": 111.2005
      },
      {
        "name": "南阳市",
        "lat": 33.0161,
        "lng": 112.5848
      },
      {
        "name": "商丘市",
        "lat": 34.4152,
        "lng": 115.6564
      },
      {
        "name": "信阳市",
        "lat": 32.1486,
        "lng": 114.0911
      },
      {
        "name": "周口市",
        "lat": 33.6347,
        "lng": 114.7012
      },
      {
        "name": "驻马店市",
        "lat": 33.014,
        "lng": 114.022
      },
      {
        "name": "济源市*",
        "lat": 35.0691,
        "lng": 112.6023
      }
    ]
  },
  {
    "name": "湖北省",
    "lat": 30.5462,
    "lng": 114.3416,
    "cities": [
      {
        "name": "武汉市",
        "lat": 30.5934,
        "lng": 114.3046
      },
      {
        "name": "黄石市",
        "lat": 30.2011,
        "lng": 115.039
      },
      {
        "name": "十堰市",
        "lat": 32.6291,
        "lng": 110.7989
      },
      {
        "name": "宜昌市",
        "lat": 30.6922,
        "lng": 111.287
      },
      {
        "name": "襄阳市",
        "lat": 32.0102,
        "lng": 112.1217
      },
      {
        "name": "鄂州市",
        "lat": 30.3915,
        "lng": 114.8949
      },
      {
        "name": "荆门市",
        "lat": 31.0354,
        "lng": 112.199
      },
      {
        "name": "孝感市",
        "lat": 30.9183,
        "lng": 113.957
      },
      {
        "name": "荆州市",
        "lat": 30.3363,
        "lng": 112.2414
      },
      {
        "name": "黄冈市",
        "lat": 30.4537,
        "lng": 114.8724
      },
      {
        "name": "咸宁市",
        "lat": 29.8413,
        "lng": 114.3226
      },
      {
        "name": "随州市",
        "lat": 31.6903,
        "lng": 113.3823
      },
      {
        "name": "恩施土家族苗族自治州",
        "lat": 30.2721,
        "lng": 109.4881
      },
      {
        "name": "仙桃市*",
        "lat": 30.3284,
        "lng": 113.443
      },
      {
        "name": "潜江市*",
        "lat": 30.402,
        "lng": 112.9003
      },
      {
        "name": "天门市*",
        "lat": 30.6637,
        "lng": 113.1665
      },
      {
        "name": "神农架林区*",
        "lat": 31.7451,
        "lng": 110.6759
      }
    ]
  },
  {
    "name": "湖南省",
    "lat": 28.116,
    "lng": 112.983,
    "cities": [
      {
        "name": "长沙市",
        "lat": 28.2283,
        "lng": 112.9389
      },
      {
        "name": "株洲市",
        "lat": 27.8289,
        "lng": 113.1328
      },
      {
        "name": "湘潭市",
        "lat": 27.8314,
        "lng": 112.9454
      },
      {
        "name": "衡阳市",
        "lat": 26.8942,
        "lng": 112.572
      },
      {
        "name": "邵阳市",
        "lat": 27.2395,
        "lng": 111.4679
      },
      {
        "name": "岳阳市",
        "lat": 29.3565,
        "lng": 113.1289
      },
      {
        "name": "常德市",
        "lat": 29.0314,
        "lng": 111.699
      },
      {
        "name": "张家界市",
        "lat": 29.1173,
        "lng": 110.4789
      },
      {
        "name": "益阳市",
        "lat": 28.5549,
        "lng": 112.356
      },
      {
        "name": "郴州市",
        "lat": 25.7701,
        "lng": 113.0155
      },
      {
        "name": "永州市",
        "lat": 26.4199,
        "lng": 111.6135
      },
      {
        "name": "怀化市",
        "lat": 27.5698,
        "lng": 110.0016
      },
      {
        "name": "娄底市",
        "lat": 27.6998,
        "lng": 111.9945
      },
      {
        "name": "湘西土家族苗族自治州",
        "lat": 28.216,
        "lng": 109.6733
      }
    ]
  },
  {
    "name": "广东省",
    "lat": 23.1333,
    "lng": 113.2669,
    "cities": [
      {
        "name": "广州市",
        "lat": 23.1301,
        "lng": 113.2645
      },
      {
        "name": "韶关市",
        "lat": 24.811,
        "lng": 113.5973
      },
      {
        "name": "深圳市",
        "lat": 22.5435,
        "lng": 114.0579
      },
      {
        "name": "珠海市",
        "lat": 22.2716,
        "lng": 113.5769
      },
      {
        "name": "汕头市",
        "lat": 23.3542,
        "lng": 116.682
      },
      {
        "name": "佛山市",
        "lat": 23.0214,
        "lng": 113.1216
      },
      {
        "name": "江门市",
        "lat": 22.5789,
        "lng": 113.0815
      },
      {
        "name": "湛江市",
        "lat": 21.2701,
        "lng": 110.3575
      },
      {
        "name": "茂名市",
        "lat": 21.6627,
        "lng": 110.9255
      },
      {
        "name": "肇庆市",
        "lat": 23.0477,
        "lng": 112.4652
      },
      {
        "name": "惠州市",
        "lat": 23.1124,
        "lng": 114.4156
      },
      {
        "name": "梅州市",
        "lat": 24.2888,
        "lng": 116.122
      },
      {
        "name": "汕尾市",
        "lat": 22.7872,
        "lng": 115.3756
      },
      {
        "name": "河源市",
        "lat": 23.7443,
        "lng": 114.7002
      },
      {
        "name": "阳江市",
        "lat": 21.8569,
        "lng": 111.9834
      },
      {
        "name": "清远市",
        "lat": 23.6821,
        "lng": 113.0561
      },
      {
        "name": "东莞市",
        "lat": 23.021,
        "lng": 113.7519
      },
      {
        "name": "中山市",
        "lat": 22.517,
        "lng": 113.3925
      },
      {
        "name": "潮州市",
        "lat": 23.6577,
        "lng": 116.6219
      },
      {
        "name": "揭阳市",
        "lat": 23.551,
        "lng": 116.3727
      },
      {
        "name": "云浮市",
        "lat": 22.9152,
        "lng": 112.0445
      }
    ]
  },
  {
    "name": "广西壮族自治区",
    "lat": 22.8167,
    "lng": 108.3275,
    "cities": [
      {
        "name": "南宁市",
        "lat": 22.8177,
        "lng": 108.3664
      },
      {
        "name": "柳州市",
        "lat": 24.3264,
        "lng": 109.4281
      },
      {
        "name": "桂林市",
        "lat": 25.2356,
        "lng": 110.1798
      },
      {
        "name": "梧州市",
        "lat": 23.4767,
        "lng": 111.279
      },
      {
        "name": "北海市",
        "lat": 21.4813,
        "lng": 109.1202
      },
      {
        "name": "防城港市",
        "lat": 21.6867,
        "lng": 108.3547
      },
      {
        "name": "钦州市",
        "lat": 21.9809,
        "lng": 108.6544
      },
      {
        "name": "贵港市",
        "lat": 23.1118,
        "lng": 109.5989
      },
      {
        "name": "玉林市",
        "lat": 22.654,
        "lng": 110.181
      },
      {
        "name": "百色市",
        "lat": 23.9031,
        "lng": 106.6187
      },
      {
        "name": "贺州市",
        "lat": 24.4042,
        "lng": 111.5672
      },
      {
        "name": "河池市",
        "lat": 24.4852,
        "lng": 108.6364
      },
      {
        "name": "来宾市",
        "lat": 23.7501,
        "lng": 109.2212
      },
      {
        "name": "崇左市",
        "lat": 22.3771,
        "lng": 107.365
      }
    ]
  },
  {
    "name": "海南省",
    "lat": 20.0186,
    "lng": 110.3488,
    "cities": [
      {
        "name": "海口市",
        "lat": 20.0463,
        "lng": 110.2002
      },
      {
        "name": "三亚市",
        "lat": 18.2529,
        "lng": 109.5117
      },
      {
        "name": "三沙市",
        "lat": 16.831,
        "lng": 112.3386
      },
      {
        "name": "儋州市",
        "lat": 19.5209,
        "lng": 109.5808
      },
      {
        "name": "五指山市*",
        "lat": 18.7748,
        "lng": 109.5168
      },
      {
        "name": "琼海市*",
        "lat": 19.2591,
        "lng": 110.4745
      },
      {
        "name": "文昌市*",
        "lat": 19.5442,
        "lng": 110.7975
      },
      {
        "name": "万宁市*",
        "lat": 18.7937,
        "lng": 110.3926
      },
      {
        "name": "东方市*",
        "lat": 19.0952,
        "lng": 108.6518
      },
      {
        "name": "定安县*",
        "lat": 19.6812,
        "lng": 110.358
      },
      {
        "name": "屯昌县*",
        "lat": 19.3517,
        "lng": 110.1017
      },
      {
        "name": "澄迈县*",
        "lat": 19.7389,
        "lng": 110.0075
      },
      {
        "name": "临高县*",
        "lat": 19.912,
        "lng": 109.6905
      },
      {
        "name": "白沙黎族自治县*",
        "lat": 19.2216,
        "lng": 109.4429
      },
      {
        "name": "昌江黎族自治县*",
        "lat": 19.2981,
        "lng": 109.0558
      },
      {
        "name": "乐东黎族自治县*",
        "lat": 18.7501,
        "lng": 109.1734
      },
      {
        "name": "陵水黎族自治县*",
        "lat": 18.506,
        "lng": 110.0376
      },
      {
        "name": "保亭黎族苗族自治县*",
        "lat": 18.6403,
        "lng": 109.7003
      },
      {
        "name": "琼中黎族苗族自治县*",
        "lat": 19.0333,
        "lng": 109.8384
      }
    ]
  },
  {
    "name": "重庆市",
    "lat": 29.5627,
    "lng": 106.5518,
    "cities": [
      {
        "name": "万州区",
        "lat": 30.8076,
        "lng": 108.4086
      },
      {
        "name": "涪陵区",
        "lat": 29.7525,
        "lng": 107.2465
      },
      {
        "name": "渝中区",
        "lat": 29.5526,
        "lng": 106.569
      },
      {
        "name": "大渡口区",
        "lat": 29.4845,
        "lng": 106.4823
      },
      {
        "name": "江北区",
        "lat": 29.6066,
        "lng": 106.5743
      },
      {
        "name": "沙坪坝区",
        "lat": 29.541,
        "lng": 106.4569
      },
      {
        "name": "九龙坡区",
        "lat": 29.5023,
        "lng": 106.5105
      },
      {
        "name": "南岸区",
        "lat": 29.5011,
        "lng": 106.6443
      },
      {
        "name": "北碚区",
        "lat": 29.8052,
        "lng": 106.3956
      },
      {
        "name": "綦江区",
        "lat": 29.0281,
        "lng": 106.6512
      },
      {
        "name": "大足区",
        "lat": 29.7076,
        "lng": 105.7218
      },
      {
        "name": "渝北区",
        "lat": 29.7182,
        "lng": 106.6307
      },
      {
        "name": "巴南区",
        "lat": 29.4023,
        "lng": 106.5406
      },
      {
        "name": "黔江区",
        "lat": 29.5336,
        "lng": 108.7707
      },
      {
        "name": "长寿区",
        "lat": 29.8579,
        "lng": 107.0809
      },
      {
        "name": "江津区",
        "lat": 29.32,
        "lng": 106.2644
      },
      {
        "name": "合川区",
        "lat": 29.972,
        "lng": 106.2762
      },
      {
        "name": "永川区",
        "lat": 29.3564,
        "lng": 105.927
      },
      {
        "name": "南川区",
        "lat": 29.1579,
        "lng": 107.0991
      },
      {
        "name": "璧山区",
        "lat": 29.5775,
        "lng": 106.2049
      },
      {
        "name": "铜梁区",
        "lat": 29.8452,
        "lng": 106.0563
      },
      {
        "name": "潼南区",
        "lat": 30.1911,
        "lng": 105.8405
      },
      {
        "name": "荣昌区",
        "lat": 29.4169,
        "lng": 105.6118
      },
      {
        "name": "开州区",
        "lat": 31.1604,
        "lng": 108.3934
      },
      {
        "name": "梁平区",
        "lat": 30.6542,
        "lng": 107.7696
      },
      {
        "name": "武隆区",
        "lat": 29.3257,
        "lng": 107.76
      },
      {
        "name": "城口县",
        "lat": 31.9473,
        "lng": 108.6643
      },
      {
        "name": "丰都县",
        "lat": 29.8638,
        "lng": 107.7311
      },
      {
        "name": "垫江县",
        "lat": 30.3275,
        "lng": 107.3325
      },
      {
        "name": "忠县",
        "lat": 30.2998,
        "lng": 108.0381
      },
      {
        "name": "云阳县",
        "lat": 30.9306,
        "lng": 108.6975
      },
      {
        "name": "奉节县",
        "lat": 31.0185,
        "lng": 109.4011
      },
      {
        "name": "巫山县",
        "lat": 31.0748,
        "lng": 109.879
      },
      {
        "name": "巫溪县",
        "lat": 31.3986,
        "lng": 109.57
      },
      {
        "name": "石柱土家族自治县",
        "lat": 29.9991,
        "lng": 108.1143
      },
      {
        "name": "秀山土家族苗族自治县",
        "lat": 28.4482,
        "lng": 109.0071
      },
      {
        "name": "酉阳土家族苗族自治县",
        "lat": 28.8414,
        "lng": 108.7673
      },
      {
        "name": "彭水苗族土家族自治县",
        "lat": 29.2937,
        "lng": 108.1656
      }
    ]
  },
  {
    "name": "四川省",
    "lat": 30.6517,
    "lng": 104.0765,
    "cities": [
      {
        "name": "成都市",
        "lat": 30.573,
        "lng": 104.0663
      },
      {
        "name": "自贡市",
        "lat": 29.3392,
        "lng": 104.7793
      },
      {
        "name": "攀枝花市",
        "lat": 26.5586,
        "lng": 101.7291
      },
      {
        "name": "泸州市",
        "lat": 28.871,
        "lng": 105.4419
      },
      {
        "name": "德阳市",
        "lat": 31.1274,
        "lng": 104.3978
      },
      {
        "name": "绵阳市",
        "lat": 31.4677,
        "lng": 104.6791
      },
      {
        "name": "广元市",
        "lat": 32.4358,
        "lng": 105.844
      },
      {
        "name": "遂宁市",
        "lat": 30.5327,
        "lng": 105.5926
      },
      {
        "name": "内江市",
        "lat": 29.5802,
        "lng": 105.058
      },
      {
        "name": "乐山市",
        "lat": 29.5523,
        "lng": 103.7661
      },
      {
        "name": "南充市",
        "lat": 30.8372,
        "lng": 106.1106
      },
      {
        "name": "眉山市",
        "lat": 30.0771,
        "lng": 103.8484
      },
      {
        "name": "宜宾市",
        "lat": 28.7524,
        "lng": 104.6428
      },
      {
        "name": "广安市",
        "lat": 30.4564,
        "lng": 106.6326
      },
      {
        "name": "达州市",
        "lat": 31.2093,
        "lng": 107.4678
      },
      {
        "name": "雅安市",
        "lat": 30.01,
        "lng": 103.0415
      },
      {
        "name": "巴中市",
        "lat": 31.8679,
        "lng": 106.7475
      },
      {
        "name": "资阳市",
        "lat": 30.1292,
        "lng": 104.6273
      },
      {
        "name": "阿坝藏族羌族自治州",
        "lat": 31.8994,
        "lng": 102.2245
      },
      {
        "name": "甘孜藏族自治州",
        "lat": 30.0495,
        "lng": 101.9623
      },
      {
        "name": "凉山彝族自治州",
        "lat": 27.8814,
        "lng": 102.2677
      }
    ]
  },
  {
    "name": "贵州省",
    "lat": 26.6003,
    "lng": 106.7053,
    "cities": [
      {
        "name": "贵阳市",
        "lat": 26.6467,
        "lng": 106.6282
      },
      {
        "name": "六盘水市",
        "lat": 26.5925,
        "lng": 104.8304
      },
      {
        "name": "遵义市",
        "lat": 27.7219,
        "lng": 107.0319
      },
      {
        "name": "安顺市",
        "lat": 26.2531,
        "lng": 105.9476
      },
      {
        "name": "毕节市",
        "lat": 27.2836,
        "lng": 105.2915
      },
      {
        "name": "铜仁市",
        "lat": 27.7316,
        "lng": 109.1895
      },
      {
        "name": "黔西南布依族苗族自治州",
        "lat": 25.0877,
        "lng": 104.9064
      },
      {
        "name": "黔东南苗族侗族自治州",
        "lat": 26.5838,
        "lng": 107.9828
      },
      {
        "name": "黔南布依族苗族自治州",
        "lat": 26.2531,
        "lng": 107.5223
      }
    ]
  },
  {
    "name": "云南省",
    "lat": 25.0464,
    "lng": 102.7094,
    "cities": [
      {
        "name": "昆明市",
        "lat": 24.8815,
        "lng": 102.8337
      },
      {
        "name": "曲靖市",
        "lat": 25.4909,
        "lng": 103.7963
      },
      {
        "name": "玉溪市",
        "lat": 24.3468,
        "lng": 102.5267
      },
      {
        "name": "保山市",
        "lat": 25.112,
        "lng": 99.1615
      },
      {
        "name": "昭通市",
        "lat": 27.3382,
        "lng": 103.7171
      },
      {
        "name": "丽江市",
        "lat": 26.8552,
        "lng": 100.2259
      },
      {
        "name": "普洱市",
        "lat": 22.8252,
        "lng": 100.966
      },
      {
        "name": "临沧市",
        "lat": 23.8842,
        "lng": 100.0888
      },
      {
        "name": "楚雄彝族自治州",
        "lat": 25.0457,
        "lng": 101.5283
      },
      {
        "name": "红河哈尼族彝族自治州",
        "lat": 23.3631,
        "lng": 103.3749
      },
      {
        "name": "文山壮族苗族自治州",
        "lat": 23.401,
        "lng": 104.2157
      },
      {
        "name": "西双版纳傣族自治州",
        "lat": 22.009,
        "lng": 100.797
      },
      {
        "name": "大理白族自治州",
        "lat": 25.6065,
        "lng": 100.2676
      },
      {
        "name": "德宏傣族景颇族自治州",
        "lat": 24.4331,
        "lng": 98.5856
      },
      {
        "name": "怒江傈僳族自治州",
        "lat": 25.8176,
        "lng": 98.8566
      },
      {
        "name": "迪庆藏族自治州",
        "lat": 27.8191,
        "lng": 99.7021
      }
    ]
  },
  {
    "name": "西藏自治区",
    "lat": 29.6487,
    "lng": 91.1174,
    "cities": [
      {
        "name": "拉萨市",
        "lat": 29.6535,
        "lng": 91.1719
      },
      {
        "name": "日喀则市",
        "lat": 29.2668,
        "lng": 88.8804
      },
      {
        "name": "昌都市",
        "lat": 31.1429,
        "lng": 97.1704
      },
      {
        "name": "林芝市",
        "lat": 29.6487,
        "lng": 94.3614
      },
      {
        "name": "山南市",
        "lat": 29.2377,
        "lng": 91.7714
      },
      {
        "name": "那曲市",
        "lat": 31.4779,
        "lng": 92.0515
      },
      {
        "name": "阿里地区",
        "lat": 32.501,
        "lng": 80.1058
      }
    ]
  },
  {
    "name": "陕西省",
    "lat": 34.2666,
    "lng": 108.9539,
    "cities": [
      {
        "name": "西安市",
        "lat": 34.3432,
        "lng": 108.9396
      },
      {
        "name": "铜川市",
        "lat": 34.8971,
        "lng": 108.9451
      },
      {
        "name": "宝鸡市",
        "lat": 34.3629,
        "lng": 107.2377
      },
      {
        "name": "咸阳市",
        "lat": 34.3299,
        "lng": 108.7088
      },
      {
        "name": "渭南市",
        "lat": 34.5206,
        "lng": 109.471
      },
      {
        "name": "延安市",
        "lat": 36.6501,
        "lng": 109.4947
      },
      {
        "name": "汉中市",
        "lat": 33.0664,
        "lng": 107.0232
      },
      {
        "name": "榆林市",
        "lat": 38.2858,
        "lng": 109.7341
      },
      {
        "name": "安康市",
        "lat": 32.6854,
        "lng": 109.029
      },
      {
        "name": "商洛市",
        "lat": 33.8734,
        "lng": 109.9186
      }
    ]
  },
  {
    "name": "甘肃省",
    "lat": 36.0606,
    "lng": 103.8268,
    "cities": [
      {
        "name": "兰州市",
        "lat": 36.0608,
        "lng": 103.8342
      },
      {
        "name": "嘉峪关市",
        "lat": 39.7732,
        "lng": 98.2882
      },
      {
        "name": "金昌市",
        "lat": 38.5215,
        "lng": 102.188
      },
      {
        "name": "白银市",
        "lat": 36.5451,
        "lng": 104.1389
      },
      {
        "name": "天水市",
        "lat": 34.5815,
        "lng": 105.7248
      },
      {
        "name": "武威市",
        "lat": 37.929,
        "lng": 102.6378
      },
      {
        "name": "张掖市",
        "lat": 38.9248,
        "lng": 100.4499
      },
      {
        "name": "平凉市",
        "lat": 35.5424,
        "lng": 106.6649
      },
      {
        "name": "酒泉市",
        "lat": 39.7334,
        "lng": 98.4943
      },
      {
        "name": "庆阳市",
        "lat": 35.7095,
        "lng": 107.6434
      },
      {
        "name": "定西市",
        "lat": 35.6079,
        "lng": 104.5923
      },
      {
        "name": "陇南市",
        "lat": 33.3702,
        "lng": 104.9603
      },
      {
        "name": "临夏回族自治州",
        "lat": 35.6018,
        "lng": 103.2104
      },
      {
        "name": "甘南藏族自治州",
        "lat": 34.9833,
        "lng": 102.9117
      }
    ]
  },
  {
    "name": "青海省",
    "lat": 36.6225,
    "lng": 101.7805,
    "cities": [
      {
        "name": "西宁市",
        "lat": 36.676,
        "lng": 101.7582
      },
      {
        "name": "海东市",
        "lat": 36.4734,
        "lng": 102.4106
      },
      {
        "name": "海北藏族自治州",
        "lat": 36.9546,
        "lng": 100.9009
      },
      {
        "name": "黄南藏族自治州",
        "lat": 35.5193,
        "lng": 102.0154
      },
      {
        "name": "海南藏族自治州",
        "lat": 36.2964,
        "lng": 100.6226
      },
      {
        "name": "果洛藏族自治州",
        "lat": 34.4722,
        "lng": 100.2452
      },
      {
        "name": "玉树藏族自治州",
        "lat": 33.0063,
        "lng": 97.0063
      },
      {
        "name": "海西蒙古族藏族自治州",
        "lat": 37.3481,
        "lng": 97.332
      }
    ]
  },
  {
    "name": "宁夏回族自治区",
    "lat": 38.4723,
    "lng": 106.2589,
    "cities": [
      {
        "name": "银川市",
        "lat": 38.4878,
        "lng": 106.231
      },
      {
        "name": "石嘴山市",
        "lat": 38.9846,
        "lng": 106.3828
      },
      {
        "name": "吴忠市",
        "lat": 37.9978,
        "lng": 106.1986
      },
      {
        "name": "固原市",
        "lat": 36.0163,
        "lng": 106.2427
      },
      {
        "name": "中卫市",
        "lat": 37.5002,
        "lng": 105.1968
      }
    ]
  },
  {
    "name": "新疆维吾尔自治区",
    "lat": 43.7933,
    "lng": 87.6286,
    "cities": [
      {
        "name": "乌鲁木齐市",
        "lat": 43.8254,
        "lng": 87.6168
      },
      {
        "name": "克拉玛依市",
        "lat": 45.5777,
        "lng": 84.8892
      },
      {
        "name": "吐鲁番市",
        "lat": 42.9727,
        "lng": 89.2503
      },
      {
        "name": "哈密市",
        "lat": 42.8193,
        "lng": 93.5151
      },
      {
        "name": "昌吉回族自治州",
        "lat": 44.011,
        "lng": 87.309
      },
      {
        "name": "博尔塔拉蒙古自治州",
        "lat": 44.906,
        "lng": 82.0664
      },
      {
        "name": "巴音郭楞蒙古自治州",
        "lat": 41.7641,
        "lng": 86.1453
      },
      {
        "name": "阿克苏地区",
        "lat": 41.1707,
        "lng": 80.2651
      },
      {
        "name": "克孜勒苏柯尔克孜自治州",
        "lat": 39.7162,
        "lng": 76.1682
      },
      {
        "name": "喀什地区",
        "lat": 39.4702,
        "lng": 75.9906
      },
      {
        "name": "和田地区",
        "lat": 37.1144,
        "lng": 79.9216
      },
      {
        "name": "伊犁哈萨克自治州",
        "lat": 43.9171,
        "lng": 81.3237
      },
      {
        "name": "塔城地区",
        "lat": 46.7454,
        "lng": 82.9803
      },
      {
        "name": "阿勒泰地区",
        "lat": 47.8449,
        "lng": 88.1413
      },
      {
        "name": "石河子市*",
        "lat": 44.3054,
        "lng": 86.0804
      },
      {
        "name": "阿拉尔市*",
        "lat": 40.5472,
        "lng": 81.2805
      },
      {
        "name": "图木舒克市*",
        "lat": 39.8678,
        "lng": 79.075
      },
      {
        "name": "五家渠市*",
        "lat": 44.1665,
        "lng": 87.5429
      },
      {
        "name": "北屯市*",
        "lat": 47.3267,
        "lng": 87.8344
      },
      {
        "name": "铁门关市*",
        "lat": 41.863,
        "lng": 85.6703
      },
      {
        "name": "双河市*",
        "lat": 44.8405,
        "lng": 82.3537
      },
      {
        "name": "可克达拉市*",
        "lat": 43.9404,
        "lng": 80.9942
      },
      {
        "name": "昆玉市*",
        "lat": 37.2154,
        "lng": 79.2702
      },
      {
        "name": "胡杨河市*",
        "lat": 44.6929,
        "lng": 84.8276
      },
      {
        "name": "新星市*",
        "lat": 42.797,
        "lng": 93.7483
      },
      {
        "name": "白杨市*",
        "lat": 46.728,
        "lng": 82.8969
      }
    ]
  },
  {
    "name": "台湾省",
    "lat": 25.0443,
    "lng": 121.5091,
    "cities": [
      {
        "name": "台北市",
        "lat": 25.033,
        "lng": 121.5654
      },
      {
        "name": "新北市",
        "lat": 25.0169,
        "lng": 121.4628
      },
      {
        "name": "桃园市",
        "lat": 24.9936,
        "lng": 121.301
      },
      {
        "name": "台中市",
        "lat": 24.1477,
        "lng": 120.6736
      },
      {
        "name": "台南市",
        "lat": 22.9997,
        "lng": 120.227
      },
      {
        "name": "高雄市",
        "lat": 22.6273,
        "lng": 120.3014
      }
    ]
  },
  {
    "name": "香港特别行政区",
    "lat": 22.2784,
    "lng": 114.1707,
    "cities": [
      {
        "name": "香港岛",
        "lat": 22.2783,
        "lng": 114.1747
      },
      {
        "name": "九龙",
        "lat": 22.3193,
        "lng": 114.1694
      },
      {
        "name": "新界",
        "lat": 22.4,
        "lng": 114.11
      }
    ]
  },
  {
    "name": "澳门特别行政区",
    "lat": 22.1869,
    "lng": 113.5431,
    "cities": [
      {
        "name": "澳门半岛",
        "lat": 22.1987,
        "lng": 113.5439
      },
      {
        "name": "氹仔",
        "lat": 22.156,
        "lng": 113.558
      },
      {
        "name": "路环",
        "lat": 22.126,
        "lng": 113.564
      }
    ]
  }
];

const MAINLAND_RINGS: Array<Array<[number, number]>> = [[[124.515,40.22],[125.708,40.867],[126.041,40.929],[126.539,41.367],[126.695,41.751],[126.931,41.813],[127.254,41.487],[128.115,41.364],[128.318,41.576],[128.034,42],[128.953,42.026],[129.344,42.452],[129.704,42.427],[129.897,43.002],[130.278,42.892],[130.257,42.711],[130.435,42.553],[130.523,42.622],[130.646,42.427],[130.593,42.671],[130.407,42.732],[131.146,42.937],[131.314,43.393],[131.2,43.532],[131.311,44.047],[130.965,44.851],[131.502,44.978],[131.888,45.342],[132.954,45.023],[133.139,45.127],[133.144,45.431],[133.471,45.631],[133.468,45.835],[133.91,46.254],[133.85,46.475],[134.222,47.105],[134.177,47.326],[134.568,47.478],[134.78,47.716],[134.554,47.982],[134.679,48.256],[135.096,48.438],[134.204,48.382],[133.546,48.121],[133.13,48.135],[132.661,47.945],[132.558,47.718],[131.03,47.695],[130.666,48.105],[130.845,48.296],[130.767,48.508],[130.538,48.612],[130.681,48.881],[130.238,48.869],[129.518,49.424],[129.085,49.36],[128.761,49.482],[128.744,49.595],[127.815,49.594],[127.532,49.826],[127.603,50.239],[127.332,50.341],[127.295,50.755],[126.923,51.062],[126.984,51.319],[126.821,51.281],[126.909,51.407],[126.463,51.948],[126.556,52.136],[126.307,52.206],[126.433,52.299],[125.969,52.63],[126.117,52.768],[125.679,52.861],[125.743,52.994],[125.614,53.084],[125.142,53.204],[124.872,53.099],[123.517,53.558],[120.883,53.294],[120.032,52.774],[120.076,52.586],[120.462,52.645],[120.734,52.537],[120.627,52.324],[120.787,52.158],[120.657,51.926],[120.087,51.678],[119.764,51.092],[119.126,50.389],[119.358,50.359],[119.35,50.166],[119.09,49.986],[118.575,49.931],[117.809,49.521],[116.718,49.847],[115.8,48.515],[115.823,48.259],[115.529,48.155],[115.58,47.922],[115.939,47.683],[116.266,47.877],[116.791,47.898],[117.384,47.641],[117.814,48.016],[118.568,47.992],[119.716,47.196],[119.927,46.904],[119.912,46.67],[119.374,46.603],[118.914,46.775],[118.788,46.687],[118.316,46.739],[117.748,46.522],[117.42,46.582],[117.372,46.36],[116.585,46.293],[116.175,45.689],[115.365,45.392],[114.551,45.387],[114.117,44.957],[113.631,44.745],[112.003,45.091],[111.765,44.969],[111.416,44.357],[111.87,43.94],[111.951,43.693],[111.02,43.33],[110.437,42.781],[109.292,42.436],[107.466,42.459],[105.742,41.949],[105.009,41.583],[104.524,41.662],[104.53,41.875],[103.419,41.882],[102.712,42.153],[102.07,42.232],[101.804,42.504],[100.863,42.671],[99.512,42.568],[97.173,42.795],[96.386,42.728],[96.364,42.901],[95.88,43.28],[95.527,44.007],[95.327,44.029],[95.414,44.299],[94.723,44.341],[93.509,44.968],[90.882,45.192],[90.677,45.582],[91.028,46.023],[90.9,46.312],[91.054,46.718],[90.561,47.207],[90.385,47.644],[90.135,47.723],[90.066,47.884],[89.762,47.836],[89.569,48.038],[89.078,47.987],[88.638,48.184],[88.523,48.403],[87.973,48.576],[88.091,48.72],[87.742,48.881],[87.912,48.98],[87.821,49.174],[87.437,49.075],[86.888,49.132],[86.732,48.995],[86.781,48.731],[86.58,48.539],[85.792,48.419],[85.587,48.192],[85.701,47.289],[85.546,47.058],[85.277,47.069],[84.955,46.861],[84.748,47.01],[83.933,46.97],[83.027,47.215],[82.267,45.62],[82.547,45.426],[82.563,45.205],[81.921,45.233],[81.788,45.384],[80.112,45.053],[79.888,44.909],[80.4,44.629],[80.394,44.127],[80.755,43.494],[80.686,43.334],[80.804,43.178],[80.379,43.032],[80.603,42.894],[80.262,42.829],[80.164,42.63],[80.292,42.26],[80.142,42.035],[78.164,41.383],[78.129,41.228],[77.836,41.153],[77.781,41.023],[76.886,41.027],[76.54,40.464],[76.333,40.343],[76.28,40.439],[75.709,40.281],[75.6,40.66],[75.242,40.449],[74.844,40.521],[74.909,40.339],[74.7,40.346],[74.357,40.089],[74.023,40.085],[73.845,39.831],[73.954,39.6],[73.868,39.483],[73.502,39.384],[73.84,39.008],[73.699,38.858],[73.799,38.611],[74.012,38.525],[74.148,38.677],[74.422,38.648],[74.863,38.484],[74.804,38.167],[75.006,37.771],[74.892,37.668],[75.14,37.355],[74.511,37.24],[74.499,37.072],[74.847,37.057],[74.894,36.94],[75.414,36.955],[75.459,36.721],[75.871,36.667],[76.061,36.225],[75.949,36.07],[76.097,36.023],[76.16,35.824],[76.558,35.923],[76.769,35.654],[77.196,35.519],[78.14,35.495],[78.017,35.228],[78.281,34.623],[79.04,34.335],[78.91,34.143],[78.661,34.087],[78.78,33.733],[78.685,33.654],[79.152,33.184],[79.308,32.597],[78.971,32.332],[78.782,32.48],[78.742,32.704],[78.395,32.53],[78.47,32.128],[78.762,31.947],[78.655,31.819],[78.846,31.61],[78.755,31.356],[79.097,30.992],[79.332,30.969],[79.405,31.072],[79.669,30.98],[80.044,30.604],[81.035,30.247],[81.132,30.016],[81.394,30.199],[81.418,30.421],[82.105,30.346],[82.178,30.068],[83.267,29.571],[83.596,29.174],[84.117,29.286],[84.234,28.889],[84.483,28.735],[84.857,28.568],[85.126,28.676],[85.113,28.345],[85.601,28.254],[85.721,28.372],[86.002,27.907],[86.125,27.923],[86.087,28.09],[86.191,28.167],[86.232,27.974],[86.415,27.905],[86.7,28.102],[87.228,27.813],[88.112,27.865],[88.764,28.068],[88.889,27.847],[88.783,27.467],[88.985,27.209],[89.183,27.374],[89.095,27.472],[89.239,27.797],[89.79,28.241],[90.702,28.076],[91.026,27.857],[91.31,28.058],[91.465,28.003],[91.612,27.891],[91.585,27.541],[92.065,27.391],[92.109,26.855],[93.568,26.938],[93.842,27.046],[94.277,27.581],[94.886,27.743],[95.74,28.275],[96.275,28.228],[97.098,27.741],[97.387,27.883],[97.35,28.236],[97.518,28.328],[97.57,28.542],[97.686,28.52],[98.139,28.142],[98.317,27.519],[98.444,27.665],[98.707,27.553],[98.782,26.621],[98.72,26.127],[98.575,26.118],[98.706,25.855],[98.529,25.841],[98.315,25.543],[98.171,25.62],[98.137,25.382],[97.94,25.215],[97.839,25.271],[97.72,25.081],[97.797,24.846],[97.547,24.739],[97.53,24.443],[97.67,24.453],[97.767,24.258],[97.528,23.927],[97.647,23.841],[98.091,24.086],[98.877,24.151],[98.669,23.801],[98.882,23.62],[98.89,23.209],[99.528,23.066],[99.563,22.926],[99.315,22.738],[99.382,22.493],[99.252,22.393],[99.22,22.111],[99.972,22.053],[99.991,21.704],[100.132,21.7],[100.131,21.504],[100.235,21.467],[100.579,21.452],[101.124,21.772],[101.222,21.234],[101.765,21.148],[101.829,21.617],[101.547,22.238],[101.672,22.475],[102.27,22.42],[102.511,22.775],[103.03,22.441],[103.323,22.808],[103.529,22.593],[103.642,22.795],[103.965,22.502],[104.118,22.809],[104.262,22.842],[104.376,22.69],[104.738,22.826],[104.86,22.971],[104.804,23.11],[105.325,23.39],[105.575,23.066],[105.879,22.917],[106.154,22.989],[106.366,22.858],[106.526,22.947],[106.839,22.803],[106.56,22.456],[106.698,21.96],[107,21.948],[107.018,21.819],[107.311,21.734],[107.364,21.602],[107.864,21.651],[108.108,21.509],[108.241,21.6],[108.23,21.491],[108.626,21.68],[109.139,21.568],[109.04,21.458],[109.139,21.389],[109.612,21.557],[109.895,21.442],[109.758,21.347],[109.656,20.929],[109.929,20.212],[110.349,20.259],[110.541,20.42],[110.393,20.816],[110.184,20.892],[110.209,21.051],[110.796,21.375],[111.973,21.603],[111.956,21.71],[112.137,21.794],[112.353,21.707],[112.647,21.758],[112.793,21.921],[112.93,21.839],[113.087,22.126],[113.267,21.872],[113.567,22.075],[113.666,22.439],[113.574,22.412],[113.74,22.534],[113.678,22.726],[113.894,22.443],[114.382,22.602],[114.507,22.439],[114.629,22.514],[114.515,22.655],[114.71,22.788],[114.746,22.582],[114.885,22.539],[115.19,22.819],[115.575,22.651],[115.654,22.866],[115.829,22.735],[116.505,22.931],[116.566,23.134],[116.807,23.201],[116.889,23.502],[117.464,23.585],[117.91,24.012],[118.159,24.27],[118.049,24.418],[118.122,24.57],[118.614,24.522],[118.786,24.777],[118.648,24.844],[118.989,24.879],[118.916,25.257],[119.074,25.211],[119.119,25.013],[119.132,25.223],[119.381,25.25],[119.145,25.388],[119.22,25.469],[119.453,25.494],[119.597,25.335],[119.675,25.468],[119.867,25.455],[119.786,25.668],[119.675,25.475],[119.479,25.632],[119.724,26.012],[119.604,26.169],[119.955,26.353],[119.788,26.583],[119.578,26.622],[119.665,26.726],[119.874,26.643],[119.943,26.784],[120.062,26.769],[119.828,26.524],[120.138,26.638],[120.054,26.864],[120.546,27.157],[120.709,27.683],[120.942,27.897],[121.192,27.823],[120.992,27.95],[121.059,28.096],[121.261,28.035],[121.489,28.302],[121.628,28.252],[121.693,28.407],[121.541,28.656],[121.775,28.864],[121.608,29.169],[121.988,29.111],[122,29.582],[121.833,29.653],[122.14,29.902],[121.721,29.993],[121.058,30.564],[121.681,30.819],[121.905,30.814],[122.133,30.595],[121.993,30.695],[121.947,31.066],[121.344,31.512],[121.434,31.591],[121.982,31.464],[121.856,31.955],[121.459,32.177],[121.39,32.461],[120.962,32.612],[120.834,33.275],[120.312,34.307],[119.238,34.799],[119.211,34.982],[119.428,35.121],[119.662,35.589],[119.925,35.637],[119.926,35.76],[120.014,35.714],[120.064,35.873],[120.305,35.972],[120.117,36.103],[120.181,36.204],[120.362,36.196],[120.286,36.047],[120.712,36.127],[120.694,36.39],[120.965,36.466],[120.847,36.619],[121.029,36.573],[121.565,36.831],[121.485,36.786],[121.652,36.724],[122.009,36.962],[122.174,36.843],[122.532,36.901],[122.484,37.129],[122.714,37.392],[122.166,37.439],[122.15,37.557],[121.571,37.441],[121.391,37.625],[121.217,37.583],[121.136,37.724],[120.733,37.834],[120.228,37.694],[120.247,37.557],[119.844,37.377],[119.892,37.264],[119.74,37.134],[119.328,37.116],[119.001,37.319],[118.989,37.621],[119.275,37.74],[118.974,38.094],[118.704,38.151],[118.552,38.056],[118.019,38.202],[117.897,38.279],[117.958,38.376],[117.645,38.528],[117.741,38.7],[117.646,38.829],[117.848,38.856],[117.838,39.057],[118.033,39.22],[118.491,38.909],[118.605,38.971],[118.579,39.131],[118.926,39.123],[119.317,39.411],[119.366,39.735],[119.541,39.888],[120.492,40.2],[120.619,40.46],[121.126,40.869],[121.816,40.895],[122.265,40.48],[121.94,40.242],[121.995,40.128],[121.779,39.943],[121.472,39.802],[121.45,39.625],[121.227,39.555],[121.27,39.374],[121.515,39.287],[121.725,39.364],[121.589,39.263],[121.632,39.078],[121.591,39.155],[121.089,38.922],[121.138,38.723],[121.709,38.873],[121.671,39.01],[121.921,38.97],[121.853,39.036],[122.062,39.06],[122.367,39.391],[123.275,39.754],[123.812,39.831],[124.151,39.746],[124.515,40.22]],[[110.106,20.027],[109.658,20.012],[109.498,19.873],[109.301,19.918],[109.147,19.705],[108.645,19.35],[108.591,19.142],[108.645,18.487],[108.881,18.416],[108.945,18.314],[109.109,18.324],[109.585,18.144],[109.75,18.194],[109.785,18.34],[110.071,18.376],[110.246,18.61],[110.499,18.652],[110.677,19.286],[111.062,19.612],[111.044,19.763],[110.966,20.018],[110.809,20.036],[110.688,20.164],[110.106,20.027]]];

function pointInRing(lng: number, lat: number, ring: Array<[number, number]>): boolean {
  let inside = false;
  for (let i = 0, j = ring.length - 1; i < ring.length; j = i++) {
    const [xi, yi] = ring[i];
    const [xj, yj] = ring[j];
    const intersect = (yi > lat) !== (yj > lat) && lng < ((xj - xi) * (lat - yi)) / (yj - yi) + xi;
    if (intersect) inside = !inside;
  }
  return inside;
}

export function isInMainlandChina(lat: number, lng: number): boolean {
  // Exclude Hong Kong and Macau SARs
  if (lat >= 22.13 && lat <= 22.562 && lng >= 113.82 && lng <= 114.45) return false;
  if (lat >= 22.10 && lat <= 22.217 && lng >= 113.52 && lng <= 113.60) return false;
  return MAINLAND_RINGS.some((ring) => pointInRing(lng, lat, ring));
}
